Repository: korotinmain/finoro
Catalog: lib/l10n/app_*.arb
Languages: uk

# splashTagline
source: Track. Budget. Grow.
uk: Відстежуй. Плануй. Зростай.

# tabDashboard
source: Dashboard
uk: Панель

# tabExpenses
source: Expenses
uk: Витрати

# tabHistory
source: Insights
uk: Аналітика

# tabSettings
source: Settings
uk: Налаштування

# dashboardLoading
source: Loading your dashboard...
uk: Завантаження панелі керування...

# dashboardError
source: We couldn’t load your dashboard.
uk: Не вдалося завантажити панель.

# dashboardRetry
source: Retry
uk: Спробувати ще раз

# dashboardSummaryTitle
source: Overview
uk: Огляд

# dashboardTotalBudget
source: Total budget
uk: Загальний бюджет

# dashboardTotalSpent
source: Total spent
uk: Витрачено

# dashboardRemaining
source: Remaining
uk: Залишок

# expensesEmptyTitle
source: No expenses yet
uk: Ще немає витрат

# expensesEmptyDescription
source: Start tracking your spending and insights will appear here.
uk: Почніть відстежувати витрати, і тут з'являться аналітики.

# createExpenseButton
source: Add Expense
uk: Додати витрату

# expensesSummaryTitle
source: Spending overview
uk: Огляд витрат

# totalTransactionsLabel
source: Transactions
uk: Транзакцій

# totalExpenseLabel
source: Total expenses
uk: Загальні витрати

# totalIncomeLabel
source: Total income
uk: Загальний дохід

# balanceLabel
source: Balance
uk: Баланс

# expensesTipsTitle
source: Quick tips
uk: Поради

# expensesTipCategorize
source: Categorize expenses when you add them
uk: Категоризуйте витрати під час додавання

# expensesTipReview
source: Review your spending weekly to stay on track
uk: Переглядайте витрати щотижня, щоб бути в курсі

# expensesTipReceipts
source: Keep receipts for big purchases
uk: Зберігайте чеки на великі покупки

# expenseDescriptionLabel
source: Description
uk: Опис

# expenseCategoryLabel
source: Category
uk: Категорія

# expenseAmountLabel
source: Amount
uk: Сума

# expenseDateLabel
source: Date
uk: Дата

# expensesSaveAction
source: Save Expense
uk: Зберегти витрату

# expenseDefaultCategory
source: General
uk: Загальна

# expenseCreatedMessage
source: Expense added
uk: Витрату додано

# expenseCreationFailed
source: Could not add expense. Try again.
uk: Не вдалося додати витрату. Спробуйте ще раз.

# deleteExpenseTitle
source: Delete expense?
uk: Видалити витрату?

# deleteExpenseConfirmation
source: This expense will be permanently removed.
uk: Цю витрату буде остаточно видалено.

# historyEmptyTitle
source: No insights yet
uk: Поки що немає аналітики

# historyEmptyDescription
source: Add a few transactions to unlock charts and breakdowns.
uk: Додайте кілька транзакцій, щоб побачити графіки та розподіл.

# historyTitle
source: Insights
uk: Аналітика

# historySubtitle
source: Visualize your financial trends
uk: Візуалізуйте свої фінансові тренди

# recentTransactionsTitle
source: Recent transactions
uk: Останні транзакції

# categoryBreakdownTitle
source: Category breakdown
uk: Розподіл за категоріями

# fieldRequired
source: This field is required
uk: Обов'язкове поле

# invalidNumber
source: Enter a valid number
uk: Введіть коректне число

# passwordStrengthVeryWeak
source: Very Weak
uk: Дуже слабкий

# passwordStrengthWeak
source: Weak
uk: Слабкий

# passwordStrengthFair
source: Fair
uk: Задовільний

# passwordStrengthMedium
source: Medium
uk: Середній

# passwordStrengthStrong
source: Strong
uk: Сильний

# passwordStrengthVeryStrong
source: Very Strong
uk: Дуже сильний

# socialWelcomeHeadline
source: Welcome to Finoro
uk: Ласкаво просимо до Finoro

# socialWelcomeBackHeadline
source: Welcome back
uk: З поверненням

# signInWithGoogle
source: Continue with Google
uk: Продовжити з Google

# signInWithApple
source: Continue with Apple
uk: Продовжити з Apple

# socialSignInDisclaimer
source: Secure authentication powered by Google and Apple.
uk: Безпечна автентифікація через Google та Apple.

# loginHeroTitle
source: Sign in to Finoro
uk: Увійдіть у Finoro

# loginHeroSubtitle
source: Stay on top of every workspace with calm, focused insights.
uk: Керуйте фінансовими проєктами спокійно та впевнено.

# signInCancelledMessage
source: Sign-in was cancelled.
uk: Вхід скасовано.

# signInGenericError
source: Couldn't complete sign-in. Please try again.
uk: Не вдалося виконати вхід. Спробуйте ще раз.

# googleSignInFailed
source: Google sign-in failed. Please try again.
uk: Не вдалося увійти через Google. Спробуйте ще раз.

# appleSignInFailed
source: Apple sign-in failed. Please try again.
uk: Не вдалося увійти через Apple. Спробуйте ще раз.

source: Sign Out
uk: Вийти

source: No signed-in user.
uk: Немає авторизованого користувача.

source: Could not refresh status.
uk: Не вдалось оновити статус.

# statusVerified
source: Verified
uk: Підтверджено

# statusUnverified
source: Unverified
uk: Не підтверджено

# errUnexpected
source: Unexpected error. Please try again.
uk: Неочікувана помилка. Спробуйте ще раз.

# errInvalidEmailFormat
source: Invalid email format.
uk: Невірний формат електронної пошти.

# errOperationNotAllowed
source: Operation not allowed.
uk: Операція заборонена.

# errAccountDisabled
source: This account has been disabled.
uk: Цей акаунт вимкнено.

# errUserNotFound
source: No account found with this email.
uk: Акаунт з цією поштою не знайдено.

# errWrongPassword
source: Incorrect password.
uk: Невірний пароль.

# errAuthFailed
source: Authentication failed.
uk: Помилка автентифікації.

# accountSectionTitle
source: Account
uk: Акаунт

source: Account Settings
uk: Налаштування акаунта

source: Change Password
uk: Змінити пароль

source: Manage Sign-In
uk: Керувати входом

source: Delete Account
uk: Видалити акаунт

source: Update Display Name
uk: Оновити ім'я

source: New display name
uk: Нове ім'я

source: Save Changes
uk: Зберегти

source: Cancel
uk: Скасувати

source: Name updated
uk: Ім'я оновлено

# actionFailed
source: Action failed. Please try again.
uk: Дію не виконано. Спробуйте ще раз.

source: Help
uk: Допомога

source: Notifications
uk: Сповіщення

source: Security & Privacy
uk: Безпека та конфіденційність

# appearanceSettings
source: Appearance
uk: Вигляд

source: Privacy & Security
uk: Приватність та безпека

source: Feedback
uk: Зворотний зв'язок

source: About
uk: Про застосунок

# confirmSignOutTitle
source: Sign Out?
uk: Вийти?

# confirmSignOutMessage
source: Are you sure you want to sign out?
uk: Ви впевнені, що хочете вийти?

source: Confirm
uk: Підтвердити

# versionLabel
source: Version {version}
uk: Версія {version}

source: Help Center
uk: Центр допомоги

# helpGettingStarted
source: Getting Started
uk: Початок роботи

# helpGettingStartedDesc
source: Learn the basics of managing your finances with Finoro
uk: Дізнайтеся основи керування фінансами з Finoro

# helpManagingExpenses
source: Managing Expenses
uk: Керування витратами

# helpManagingExpensesDesc
source: Track and categorize your daily expenses
uk: Відстежуйте та категоризуйте щоденні витрати

# helpBudgeting
source: Budgeting & Goals
uk: Бюджетування та цілі

# helpBudgetingDesc
source: Set budgets and achieve your financial goals
uk: Встановлюйте бюджети та досягайте фінансових цілей

# helpInsights
source: Financial Insights
uk: Фінансова аналітика

# helpInsightsDesc
source: Understand your spending patterns with analytics
uk: Розумійте свої витрати за допомогою аналітики

# helpAccountSecurity
source: Account & Security
uk: Акаунт та безпека

# helpAccountSecurityDesc
source: Manage your account settings and privacy
uk: Керуйте налаштуваннями та конфіденційністю

# helpContactSupport
source: Contact Support
uk: Зв'язатися з підтримкою

# helpContactSupportDesc
source: Get in touch with our support team
uk: Зв'яжіться з нашою командою підтримки

# helpFaqTitle
source: Frequently Asked Questions
uk: Часті запитання

# helpQuickTips
source: Quick Tips
uk: Швидкі поради

# helpTip1
source: 💡 Tip: Categorize expenses as you add them for better insights
uk: 💡 Порада: Категоризуйте витрати одразу для кращої аналітики

# helpTip2
source: 🎯 Tip: Set realistic budgets and review them monthly
uk: 🎯 Порада: Встановлюйте реалістичні бюджети та переглядайте їх щомісяця

# helpTip3
source: 📊 Tip: Check your Insights tab regularly to track spending trends
uk: 📊 Порада: Регулярно перевіряйте аналітику для відстеження трендів

# helpSearchPlaceholder
source: Search help topics...
uk: Пошук тем допомоги...

# helpNoResults
source: No results found
uk: Результатів не знайдено

# helpTryDifferentKeywords
source: Try different keywords or browse categories below
uk: Спробуйте інші ключові слова або перегляньте категорії нижче

source: Language
uk: Мова

source: Select Language
uk: Виберіть мову

# languageChanged
source: Language changed to {language}
uk: Мову змінено на {language}

# comingSoonAppearance
source: Appearance settings coming soon
uk: Налаштування вигляду скоро з'являться

# comingSoonNotifications
source: Notification settings coming soon
uk: Налаштування сповіщень скоро з'являться

# comingSoonSecurity
source: Security settings coming soon
uk: Налаштування безпеки скоро з'являться

# comingSoonFeedback
source: Feedback form coming soon
uk: Форма зворотного зв'язку скоро з'явиться

# comingSoonAbout
source: About screen coming soon
uk: Екран про застосунок скоро з'явиться

# comingSoonChangePassword
source: Password change is coming soon
uk: Можливість змінити пароль з'явиться скоро

# comingSoonManageSignIn
source: Managing sign-in methods is coming soon
uk: Керування способами входу з'явиться скоро

# comingSoonDeleteAccount
source: Account deletion is coming soon
uk: Видалення акаунта з'явиться скоро

# confirmDeleteAccountMessage
source: We're working on a secure account deletion flow. Please contact support in the meantime.
uk: Ми працюємо над безпечним процесом видалення акаунта. Поки що зверніться до служби підтримки.

source: Delete
uk: Видалити

# signOutSuccess
source: Successfully signed out
uk: Ви успішно вийшли

# signOutFailed
source: Failed to sign out. Please try again
uk: Не вдалося вийти. Спробуйте ще раз
